{
    "metadata": {
        "id": "CA004",
        "name": "Block High Risk Sign-Ins",
        "description": "Blocks sign-ins assessed as high risk by Entra ID Protection. Requires Entra ID P2 license.",
        "severity": "Critical",
        "category": "Identity",
        "tags": ["risk", "identity-protection", "baseline", "security"],
        "microsoftReference": "https://learn.microsoft.com/entra/identity/conditional-access/howto-conditional-access-policy-risk",
        "compliance": { "cisaScuba": ["MS.AAD.2.3v1"], "cisV6": ["5.2.2.7", "5.2.2.8"], "microsoftPreset": "N/A (requires P2)" }
    },
    "policy": {
        "displayName": "CA004 - Block High Risk Sign-Ins",
        "state": "enabledForReportingButNotEnforced",
        "conditions": {
            "clientAppTypes": ["all"],
            "applications": {
                "includeApplications": ["All"]
            },
            "users": {
                "includeUsers": ["All"]
            },
            "signInRiskLevels": ["high"]
        },
        "grantControls": {
            "operator": "OR",
            "builtInControls": ["block"]
        }
    },
    "parameters": {
        "excludeBreakGlassGroup": {
            "description": "Object ID of the break-glass/emergency access group to exclude from this policy",
            "required": true,
            "type": "groupObjectId"
        }
    }
}
